Revit 2027 API
StructuralSectionSigmaProfile.MiddleBendLength Property
 Middle Bend segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MiddleBendLength { get; set; }
Public Property MiddleBendLength As Double
	Get
	Set
public:
property double MiddleBendLength {
	double get ();
	void set (double value);
}
member MiddleBendLength : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionSigmaProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace